In [2]:
import pandas as pd
import numpy as np

In [5]:
sozluk_verisi = {"Istanbul": [30,29,np.nan], "Ankara" : [20, np.nan, 25], "izmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozluk_verisi)

In [6]:
havaDurumuDataFrame

   Istanbul  Ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [8]:
### Biz bir yerden data çektiğimizde bazı veri bilgileri eksik olabiliyor Biz bunları np.nan şeklinde gösteriyoruz.
### ve dataFrame olarak ekrana yazdırıyoruz.

# Dropna()

## `dropna()` Fonksiyonu

`dropna()` fonksiyonu, pandas DataFrame'lerinde veya Series'lerde eksik (NaN) değerleri temizlemek için kullanılır. Bu fonksiyon, eksik verilerin olduğu satırları veya sütunları kaldırmanıza yardımcı olur.

In [9]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  izmir
0      30.0    20.0     40

## `dropna()` Fonksiyonunda Kullanılabilecek Parametreler

### `axis`

- **`axis=0` (varsayılan)**: Satırları kontrol eder. Eğer bir satırda eksik değer varsa, o satır kaldırılır.
- **`axis=1`**: Sütunları kontrol eder. Eğer bir sütunda eksik değer varsa, o sütun kaldırılır.

In [12]:
havaDurumuDataFrame.dropna(axis= 1)

   izmir
0     40
1     39
2     38

In [13]:
havaDurumuDataFrame.dropna(axis= 0)

   Istanbul  Ankara  izmir
0      30.0    20.0     40

In [14]:
## dropna(), eğer hiç bir satırda yada sütunda NaN yoksa o satırı veya o sutünü getiriyor

# Thresh

## `thresh` Parametresi

### Tanım

`thresh` parametresi, bir satırda veya sütunda belirli sayıda geçerli (eksik olmayan) değeri bulundurarak bu satır veya sütunun tutulmasını sağlar. Yani, bir satır veya sütun, belirttiğiniz sayıda geçerli değeri içeriyorsa, eksik değerler olsa bile bu satır veya sütun `dropna()` işlemi sırasında kaldırılmaz.

In [21]:
yeni_data = {"Istanbul": [30,29,np.nan], "Ankara" : [20, np.nan, np.nan], "izmir": [40,39,38]}
yeni_data_frame = pd.DataFrame(yeni_data)

In [22]:
yeni_data_frame.dropna(axis= 1, thresh=2)

   Istanbul  izmir
0      30.0     40
1      29.0     39
2       NaN     38

In [23]:
yeni_data_frame

   Istanbul  Ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN     NaN     38

## fillna()

## `fillna()` Fonksiyonu

`fillna()` fonksiyonu, pandas DataFrame veya Series'lerde eksik (NaN) değerleri belirli bir değerle doldurmak için kullanılır. Bu fonksiyon, eksik verilerin yerine belirlediğiniz bir değeri koyarak veri setinizi daha eksiksiz ve analiz için daha uygun hale getirir.

In [27]:
yeni_data_frame.fillna(20)

   Istanbul  Ankara  izmir
0      30.0    20.0     40
1      29.0    20.0     39
2      20.0    20.0     38

In [28]:
## Gördüğün gibi NaN olan değerleri 20 değerleri ile doldurdu bu şekilde eksik olan verileri doldurabilşirsin